184_03_linearUpwind/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          77;
        startFace       28075;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          77;
        startFace       28152;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          184;
        startFace       28229;
    }
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          184;
        startFace       28413;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28336;
        startFace       28597;
    }
)

// ************************************************************************* //
