184_03_linearUpwind/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 72.95
);

regions
(
    boxToCell
    {
        box (0 -0.62 -1) (0.5 -0.16 1);
        fieldValues
        (
            volScalarFieldValue T 5
        );
    }
    boxToCell
    {
        box (0.5 -0.62 -1) (18.4 0 1);
        fieldValues
        (
            volScalarFieldValue T 5
        );
    }
    boxToCell
    {
        box (0 -0.31 -1) (0.5 -0.16 1);
        fieldValues
        (
            volScalarFieldValue T 100
        );
    }
);


// ************************************************************************* //
